<a href="https://colab.research.google.com/github/Vertex138/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/submissions/Colin_Brinkley_LS_DS_121_Join_and_Reshape_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

In [0]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

In [0]:
%cd instacart_2017_05_01

In [0]:
!ls -lh *.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
import pandas as pd
import seaborn as sns
import numpy as np

In [0]:
#Testing everything one at a time in the same DF to minimize RAM usage

#testDF = pd.read_csv('aisles.csv')
#testDF = pd.read_csv('departments.csv')
#testDF = pd.read_csv('order_products__prior.csv')
#testDF = pd.read_csv('order_products__train.csv')
#testDF = pd.read_csv('orders.csv')
testDF = pd.read_csv('products.csv')

In [0]:
#testDF.shape
testDF.head()

aisles.csv: No useful data

departments.csv: No useful data

order_products__prior.csv: product_id

order_products__train: product_id

orders.csv: No useful data

products.csv: product_id, product_name

In [0]:
#Importing "order_products__prior"
prior = pd.read_csv('order_products__prior.csv')

In [0]:
#Dropping unneeded columns, then checking to make sure only one column remains
prior.drop(columns = ['order_id', 'add_to_cart_order', 'reordered'], inplace = True)
prior.head()

In [0]:
#Importing "order_products__train"
train = pd.read_csv('order_products__train.csv')

In [0]:
#Dropping unneeded columns, then checking the shape to make sure only one column remains
train.drop(columns = ['order_id', 'add_to_cart_order', 'reordered'], inplace = True)
train.head()

In [0]:
#Concatenate "prior" and "train" into one DF
ordersDF = pd.concat([prior, train])
ordersDF.shape

In [0]:
#Importing
productsDF = pd.read_csv('products.csv')

In [0]:
#You know what comes next; dropping columns to save memory and check the head
productsDF.drop(columns = ['aisle_id', 'department_id'], inplace = True)
productsDF.head(10)

In [0]:
#Merge the product names onto ordersDF
countDF = pd.merge(ordersDF, productsDF, how="inner", on='product_id')

In [0]:
#Check the counts of unique values in "countDF"
countDF['product_name'].value_counts()

1. 491,291 "Bananas"
2. 394,930 "Bag of Organic Bananas"
3. 275,577 "Organic Strawberries"
4. 251,705 "Organic Baby Spinach" 
5. 220,877 "Organic Hass Avocado"
6. 184,224 "Organic Avocado"
7. 160,792 "Large Lemon" 
8. 149,445 "Strawberries"
9. 146,660 "Limes" 
10. 142,813 "Organic Whole Milk"

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
%matplotlib inline

In [62]:
#Table 1 & 2
table1 = pd.DataFrame(
  [[np.nan, 2],
  [16, 11], 
  [3, 1]],
  index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
  columns=['treatmenta', 'treatmentb'])

table2 = table1.T
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [63]:
#Table 1 --> Tidy
table1 = table1.reset_index()
tidy1 = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy1 = tidy1.rename(columns={'index': 'name', 'variable': 'treatment', 'value': 'result'})
tidy1['treatment'] = tidy1['treatment'].str.replace('treatment', '')
tidy1

           name treatment  result
0    John Smith         a     NaN
1      Jane Doe         a    16.0
2  Mary Johnson         a     3.0
3    John Smith         b     2.0
4      Jane Doe         b    11.0
5  Mary Johnson         b     1.0

In [64]:
#Tidy to Table 1 (alised "wide1")
wide1 = tidy1.pivot_table(index='name', columns='treatment', values='result')
wide1

treatment        a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [65]:
table2 = table2.reset_index()
tidy2 = table2.melt(id_vars='index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy2 = tidy2.rename(columns={'index': 'treatment', 'variable': 'name', 'value': 'result'})
tidy2['treatment'] = tidy2['treatment'].str.replace('treatment', '')
tidy2

  treatment          name  result
0         a    John Smith     NaN
1         b    John Smith     2.0
2         a      Jane Doe    16.0
3         b      Jane Doe    11.0
4         a  Mary Johnson     3.0
5         b  Mary Johnson     1.0

In [66]:
#Tidy to Table 2 (alised "wide2")
wide1 = tidy1.pivot_table(index='treatment', columns='name', values='result')
wide1

name       Jane Doe  John Smith  Mary Johnson
treatment
a              16.0         NaN           3.0
b              11.0         2.0           1.0

In [0]:
flights = sns.load_dataset('flights')

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####